Revit 2024 API
ParameterTypeId.FamilyCurveAttachmentProportion Property
 "Attachment Point"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FamilyCurveAttachmentProportion { get; }
Visual Basic
Public Shared ReadOnly Property FamilyCurveAttachmentProportion As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FamilyCurveAttachmentProportion {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace